qemu
virt-manager
cuda
gcc
cmake
make
python
nodejs
msr-tools
libvirt
kitty
git
dkms
mesa-utils
snapd
unzip
tree
python
npm
jre-openjdk
jdk-openjdk
sl
wget 
curl